import { motion } from "framer-motion";

export default function Loading() {
  return (
    <motion.div
      key={"loading"}
      initial={{ opacity: 0 }}
      animate={{ opacity: 1 }}
      exit={{ opacity: 0 }}
      transition={{ duration: 0.5 }}
      className="flex h-screen w-screen items-center justify-center"
    >
      <p className="p-4 text-xs text-[#fff] drop-shadow-[0_0_2px_#fff] sm:px-0">
        ⌈̵͈̹̦̖͖̠̦͎̳̲͇̻̮̯̞̦̘̭̀͊͋̿̌̃̄́̿̌̀̆͊͂͑̈́͋̅̅̂͐̍̾͗͗̌̈́̏̀̾͒̔̾͗̕͜͝͝͝͝ͅ⁆̵̢̢̨̧̡̨̠̩̩̰̹̯̬̖̭̭̜̮̘̦̫̖͉̥̱̺̜̎̽̌̑͑́́́̅́͆̔̒̇̾̓̆̾͒̔̆́̿̃̒̾͠͝͝⁅̶̡̬̱͚͓̙̘͕͉̰̼̲̫̩̻̞͍͍̲͍͕͖̪̺͉͖͙̻̟̥͇̯̺͈̙̫͍͈̓̋̆͛̀͌͗́̂͗̊̀̾̉̀̈́̈́̀̂̐̏̏͜͜͜͠ͅͅ⁅̶̡̢̢̨̜̪͓̫̞̫̣̼̳̜͎̗͍̤͔̭̩̺͉̘̘̦̦̻̺̘͚̥̥̤̙͓̪̖̘̃͑̾̑́̅̋̇̋͑̈́̓̑̑͑͋̇̿̌́́̑̽̋̇̉̉͌͐͌͛̏̚̕̚̕̕͜͠͠͝ͅ⌉̴̢̡̡̨̖̘̲͉̞̟͓̖̹͕̹͈͇̜̝̥͔̙̘̲̞͔̙̦̖̣̝̀͌͆̄̋́͛̑̎̀͆̌̐́̓̓́̀̆̒͒͒̓͛̇̚͝͝ͅ¦̴̢̢͙̙̯̤̹̤̜͓̪̬̳͚͉̫̝̪͈͍̩̗̣̯͕̟̟͖̿̇͗̆̆͠͝͝¦̵͚̱̈́̓̏̐͊̉̋͋̕͘͜͠¦̴̡̡̼͕̳͉̫͇̣̖̮̮͉͎̟͙̮̜̦̭̪̥̖̺̟̭͍͚̞͚̜̭̺̪̞̠̰̱̜̣͕̻̊̾̎̀͂͘͜͜ͅ¯̸̛̛͓̒͐̉͑͂̏̾̈́̀̑̾̑̈́̏̄̔̌̋̒̒̐̊́̀̆̃̇̑͌͋̆̋͘̚̚͝͝͝͝͝͝”̷̧̧̢̧̢̧̧̛̛̛̯̭͇̖͉̬̦̻͔͍̖̲͉̦͍̭̗̖̼̻̭͙͇͔͈̦̗̥̥̣̦̬̼͚̩͙̟̘̬̤̖́̏̅̍̍̍̐̂̍̓́͆͛͂̀̃̋̏͛͂̿͐͘̚̕̚͘͜͝͝‡̴̧̨̡̧̗͍̯̹̜̩͎̗͈̲̗̘̙̘̣̹̹͇̺̩͉̭̣̪͓̠̲̩̝̣̝́̌̈̂̆̍͛̎͂̅͌́͆́̾͋̒͛͆̏̈̅̓̊̽͋̈̿̀̿̽̽̈́͗͛̎͘̚̕̚͝͠ͅ⁑̶̢̧̢̧̛̛͔̳͉̘̞͉̪̭̼̟̥̔̒̔̿̓̉͗͐̽͌͑̈́̽̃̔͗̇̐͘̚͜͝¦̵̨̨̨̦̩̝̭̯̣͚͙̦̩̭͖̰͇̳͚̹̤̦̝͚̪̎͑̾̐̈́͊̂͛͒̈̊͗̔̓̆̀̈́͆̽̎͛̆̀̒̆̐͛́̑̐͑̆̅̕͜͜͝.̷̥̦̫̺̹̭̪͍̰͚͗̍̐̊͑̀͑͋̾͋̚͝͠.̷̧͚̘̤̠̥̹̦͔͙͍̯̗̟͚̈́̎̊͂̈́́̎̄̀̉́̋̆͋̊̏̋̒̀͛͘̚̚͝͝ͅ.̴̡̨̛̟̼͎̗̩͎̟͔͚̬͓̹̣̥̫̮͕̮̥̣̭̩̭͙͕͈̲̻͎̯̰͚̣̭̹͉̙̫̂͛̍̒̈́͆̀̊̈͑̒͊́̀͒͛̇̈́͊̅͆͋̌̒͛̅̈́̍̌̽͂̆̔͑̅̂͂͗͛̿̓͂̚͘̚̕͘͜͠͠ͅ
      </p>
    </motion.div>
  );
}
